tests/TestCompose_of-ccx.Ubuntu1604.home/referenceOutput/Inner-Fluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/Zone_solid_2";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 101325;
    }
    inlet
    {
        type            calculated;
        value           uniform 101325;
    }
    interface
    {
        type            calculated;
        value           uniform 101325;
    }
    adiabatic
    {
        type            calculated;
        value           uniform 101325;
    }
}


// ************************************************************************* //
