tests/TestCompose_of-ccx.Ubuntu1604.home/referenceOutput/Inner-Fluid/constant/polyMesh/blockMeshDict
FoamFile {
    class dictionary;
    format ascii;
    object blockMeshDict;
    version 2.0;
}
convertToMeters 1;
XMIN -0.64943532;
XMAX 0.64943532;
YMIN -0.64943532;
YMAX 0.64943532;
ZMIN -3.45;
ZMAX 3.45;
vertices (($XMIN $YMIN $ZMIN) ($XMAX $YMIN $ZMIN) ($XMAX $YMAX $ZMIN) ($XMIN $YMAX $ZMIN) ($XMIN $YMIN $ZMAX) ($XMAX $YMIN $ZMAX) ($XMAX $YMAX $ZMAX) ($XMIN $YMAX $ZMAX));
blocks (hex (0 1 2 3 4 5 6 7) (16 16 83) simpleGrading (1 1 1));
edges ();
boundary
(
    boundingBox1 {
        faces ((3 7 6 2));
        type patch;
    }
    boundingBox2 {
        faces ((1 5 4 0));
        type patch;
    }
    boundingBox3 {
        faces ((0 4 7 3));
        type patch;
    }
    boundingBox4 {
        faces ((2 6 5 1));
        type patch;
    }
    boundingBox5 {
        faces ((0 3 2 1));
        type patch;
    }
    boundingBox6 {
        faces ((4 5 6 7));
        type patch;
    }

);